""" Я и сам своего рода переводчик
Дана строка соответствия латинскому алфавиту: первый символ строки соответствует букве a, второй — b,
третий — c, и так далее. Каждый символ соответствует как заглавной, так и строчной буквам.
Количество символов в строке совпадает с количеством букв в латинском алфавите.

Напишите программу, которая с помощью данной строки переводит заданный текст.

Формат входных данных
На вход программе в первой строке подается строка соответствия латинскому алфавиту,
в следующей — текст, требующий перевода.

Формат выходных данных
Программа должна с помощью данной строки соответствия латинскому алфавиту перевести
введенный текст и вывести полученный результат."""


a, b = input(), input().lower()

alp = 'abcdefghijklmnopqrstuvwxyz'

new_lst = []

for i in range(len(b)):
    if b[i] in alp:
        new_lst.append(a[alp.index(b[i])])
    elif b[i] not in alp:
        new_lst.append(b[i])

for i in new_lst:
    print(i, end='')


"""Sample Input 1:

??????????????????????????
I love Python =)
Sample Output 1:

? ???? ?????? =) """

"""Sample Input 2:

??????????????????????????
Dont be so sad!
Sample Output 2:

???? ?? ?? ???!"""
